<template>
    <div class="rules">
        <h1>Правила посещения классов и частые вопросы</h1>
        <div class="rules-body">
            <info-card>
                <p>
                    Ответы на частые вопросы:
                </p>
                <info-drop-down
                    v-for="item in data"
                    :key="item.id"
                    :item="item"
                />
            </info-card>
        </div>
        <p>
            Надеемся, что мы смогли ответить на большинство твоих вопросов.
            Если у тебя еще остались вопросы, то мы всегд ответим тебе в наших
            соц. сетях или же в общем чате участников.
        </p>
        <p>
            А сейчас, мы более подробно опишем правила поведения
            на тренировках и некоторых условия при записи на классы.
        </p>
        <info-list
            :active="true"
            :text="text"
            add-class="mb"
        />
    </div>
</template>

<script lang="ts">

import { Component, Vue } from "vue-property-decorator"
import InfoCard from "@/components/InfoCard.vue"
import InfoDropDown from "@/components/InfoDropDown.vue"
import InfoList from "@/components/InfoList.vue"

@Component({
    components: {
        InfoCard,
        InfoDropDown,
        InfoList,
    },
})
export default class RulesView extends Vue {

    data = [
        {
            id:    1,
            title: "С какого возраста можно прийти на классы?",
            text:  ["На классы можно записаться с 14+ лет. Если тебе 13 и есть большооое желание заниматься - напиши нам в соц. сетях. Договоримся ;)"],
        },
        {
            id:    2,
            title: "Нужен ли опыт в танцах?",
            text:  ["Опыт желателен. Так как PANDORA - не школа танцев. Мы не учим танцевать с нуля, поэтому для тех, кто никогда не танцевал будет тяжеловато. Но в k-pop, как правило, можно прийти с любым опытом. Главное желание! Попробуй, вдруг ты прирожденный танцор."],
        },
        {
            id:    3,
            title: "Как проходят тренировки?",
            text:  ["В начале занятия тренер отмечает всех пришедших на класс. Второй важный этап - разминка. И конечно же, изучение самой хореографии. В конце занятия чаще всего проходит съемка."],
        },
        {
            id:    4,
            title: "Обязательно ли сниматься на классах?",
            text:  ["Совсем не обязательно. Это делается по желанию. Но мы рекомендуем, так как после занятия у тебя останется не только воспоминания, но и посмотришь на результат свой результат. Если это серия классов с одной хореографией, то можно будет сравнить свою первую тренировку и финальную."],
        },
        {
            id:    5,
            title: "Сколько длится занятие?",
            text:  ["Занятие длится 2.5 часа."],
        },
        {
            id:    6,
            title: "Стоимость классов?",
            text:  ["Один класс стоит 500 р. (один класс - 2.5 часа)  В “project” классах* на финальном занятии проходит профессиональная съемка. Такое занятие будет стоить 600 р."],
        },
        {
            id:    7,
            title: "Как проходит оплата?",
            text:  ["Оплатить можно как переводом на карту, так и наличными. Если оплачиваете переводом на карту - обязательно в комментариях укажите свои фамилию, имя, а также лично напишите тренеру, что оплатили. Если оплачиваете наличными, то оплата происходит до занятия."],
        },
        {
            id:    8,
            title: "Где находится зал?",
            text:  ["Тренировеки проходят по адресу: г. Тула, ул. Жуковского, 29. Место проведения может изменитьс. Мы всем сообщим об этом, если это случится."],
        },
        {
            id:    9,
            title: "Обязательно посещать классы каждую неделю?",
            text:  ["Всё зависит от того, на какой класс ты планируешь прийти. Если это “open” классы*, то прийти можно на любую понравившуюся хореографию. Если это “project” класс*, то необходимо посетить все серии классов, так как каждое занятие мы будем узучать продолжение хореографии. А в конце снимать клип. Если человек пропустит одну тренировку, то необходимо отработать самостоятельно пропущенную часть хореографии."],
        },
        {
            id:    10,
            title: "Почему классы проходят раз в неделю?",
            text:  ["К сожалению, у PANDORA нет своей студии или студии танцев, которая могла бы спонсировать наши занятия. Поэтому классы проходят в арендованном помещении. Очень тяжело найти свободное место в зале среди недели. Самое свободное время - это выходные. Поэтому каждое воскресенье мы собираемся вместе и 2.5 часа проводим это время активно и с пользой."],
        },
        {
            id:    11,
            title: "Кто ведет тренировки?",
            text:  ["Классы проводит опытный тренер - Настя. Уже более 10 лет увлекатеся k-pop, танцует примерно столько же лет. Участвовала во многих фестивалях и мероприятиях, преподавала в школе танцев k-pop направление. Подробнее можно узнать в нашем разделе “О нас”"],
        },
        {
            id:    12,
            title: "Как выбирается хореография?",
            text:  ["Хореографию подбирает тренер классов. Иногда проходят голосования."],
        },
        {
            id:    13,
            title: "Что значит закрытая группа?",
            text:  ["В закрытую группу (“project” классы) можно записаться только один раз. В течение месяца группа изучает одну хореографию. В конце финальная тренировка с профессиональной съемкой."],
        },
    ]

    text = [
        "Как нужно вести себя в залах для тренировок: как и в любом приличном месте ведем мы себя хорошо ;) Мы не мусорим, мы не ходим в грязной обуви в зале, мы не оставляем вещи после завершения занятия. PANDORA, также как и школа танцев, которая предоставляет зал - не несет ответственности за потерянные вещи. Будь внимательнее! Если ты забыл переобувку - не нужно “в тихую” заниматься в уличной обуви. Пожалуйста, ты можешь заниматься без обуви - зал чистый. Только мы с тобой вместе создаем комфортную атмосферу для тренировок! Конечно же, не можем не упомянуть, что на занятиях тренер учит тебя хореографии, а не ты его. Будьте пунктуальными. Также, уважайте других присутствующих в зале. Ты пришёл на классы, чтобы вместе со всеми изучать любимую хореографию, а не болтать и мешать остальным. Пожалуйста, не заставляй тренера отвлекаться лишний раз на тебя и делать замечание.",
        "Про физическую подготовку и здоровье: если ты записался на классы, но у тебя есть какие-то противопоказания по физическим активностям - необходимо за-ра-нее предупредить тренера об этом. Но перед тем, как записаться на классы, ты должен учитывать, что это танцы, это могут быть как сложные хореографии, так и простые. Если вдруг, тебе стало нехорошо в зале, стоит также сразу предупредить тренера, передохнуть и сообщить о своем состоянии. Не нужно “страдать”, “терпеть”. Если наконуне заболел, настоятельно рекомендуем оставаться дома. Даже если это “важная” тренировка, даже если тебе с утра стало “лучше” или уже чувствуешь, что выздоравливаешь. Пожалуйста, оставайтесь до-ма. От одного пропущенного занятия ничего не случится. Ты всегда можешь попросить тренера заснять занятие и прислать видео, чтобы не пропустить, но возвращаться в зал необходимо только при полном здоровом состоянии.",
        "Про опоздания: лучше так не делать~ Но если такая ситуация возникла, то большая просьба к “опоздунам” не мешать проведению класса. Тихонечко зашли в зал. Пропустили разминку: сделайте ее самостоятельно, чтобы избежать травм, и только потом присоединяйтесь ко всем.",
        "Про оплату: если ты оплачиваешь преводом, то обязательно укажи свои фамилию и имя в комментариях и максимально желательно написать лично тренеру, что перевод совершен (уведомления о переводе могут приходить с задержкой или вовсе не приходить). Если ты оплачиваешь наличными - то оплата происходит во время занятия в начале тренировки, когда все зашли в зал. Не нужно в индивидуальном порядке подходить до занятия к тренеру и просить принять оплату. Тренер может не записать тебя, а после - забыть про это.",
        "Про абонементы: у нас нет обычного понятия “абонементы”, как в школе танцев. Наши абонементы зависят от месяца. Если был объявлен месяц “project” классов, то абонемент будет стоить 2000 р. + 100 р. (4 воскресенья месяца + оплата проф съемки в финальном занятии). Оплата также возможна наличными или переводом. Тренер всё зафиксирует, и тогда тебе можно забыть об оплате до следующего месяца. Если месяц объявлен “open” классов, то абонемент будет также на месяц 2000 р. (4 воскресенья). Стоимость может измениться, следите за акциями в соц. сетях. Спросите: “- а можно ли без абонементов?”, “- да, можно”. Ты просто оплачиваешь каждую тренировку по 500 р. (или 600 р. за занятие с проф. съемкой)",
        "О возврате средств: те, кто оплачивают наличными каждое занятие - вам повезло, и санкции вас не коснутся. Но те, кто оплатил абонемент (не важно каким способом) и те, кто оплатил одно занятие переводом - мы оставляем право возвращать не полную стоимость. Почему и сколько возвращается? Почему: ты был записан на занятие и пообещал прийти, тренер готовился всю неделю, чтобы на тренировке всё прошло супер, но ты решил в какой-то момент не прийти. Очень обидно. Поэтому, у нас есть условия для таких людей:\n\n" +
        "1. если ты заболел, что-то серьезное случилось, напиши об этом тренеру и, вероятно, тебе вернется полная стоимость за занятия(ий), которые ты пропустил. Все мы люди, случится может что угодно.\n\n" +
        "2. если у тебя возникла внезапно какая-то поездка, день рождения друга, кошки, собаки, внезапно навалилось много домашней работы: то стоимость возвращается, но 100 р. с каждого пропущенного занятия, остается тренеру на дорогу и за его старания подготовиться к тренировке. \n\n" +
        "3. если ты забыл предупредить о том, что не придешь, или предупредил в день тренировки - то стоимость и вовсе не возвращается. Чтобы такого не случилось - предупреждайте, пожалуйста, за-ра-нее, желательно в пятницу.\n\n" +
        "4. есть небольшие бонусы для старательных: если ты не смог прийти, но очень хотел, тренер тебе пришлет небольшое видео-разбор с тренировки, но оставляет за собой право не возвращать уже 200 р.\n\n" +
        "Надеемся на понимание.",
        "Про классы и разделение на “open” и “project”: наши классы делятся на два вида.\n\n" +
        "1. “Open” классы - каждую тренировку новый танец. Разбираем самую сочную часть, в конце пробуем сниматься, делать коллабы. Прийти на такие классы могут все по предварительной записи. Выбирай понравившуюся хореографию, записывайся и приходи на тренировку.\n\n" +
        "2. “Project” классы - целый месяц разбираем один танец. Прийти по-прежнему может любой, кому нравится хореография, но запись ведется только один раз перед началом серии тренировок. Далее группа закрывается и в течение месяца изучаем, разбираем большую часть хореографии. Иногда делимся на основной состав и подтанц, иногда тренер делает расстановку для всех участников “project” класса. Данные тренировки максимально помогают проникнуться атмосферой командной подготовки к проекту. Начиная от разбора хореографии, заканчивая подбором костюмов и профессиональной съемкой.",
        "Про видеосъемку: в PANDORA мы всегда делаем видеосъемку, как показетель результата обучения. На “open” классах съемку делает тренер и его помощник. На “project” классах видеосъемку ведёт профессиональный видеограф. Мы всегда делимся с участниками классов видео с тренировок. Поэтому по завершению класса в течение 1-2 дней мы отправляем тебе видео, которые ты можешь посмотреть, скачать. Профессиональное видео придётся подождать немного долльше - до 7 дней.",
        "Поддержка cover групп: PANDORA стремится к дружественному k-pop комьюнити в Туле. Благодаря нашим классам, ты найдешь друзей и единомышленников, с которыми, возможно, создашь свою cover группу. Естестенно, мы поддержим вас! Группы, в составке которых есть наши участники, будут продвигаться в наших соц сетях, мы посоветуем тренировочные залы, подскажем где найти хорошего видеографа, локации для съемки танца. Взамен попросим не забывать о наших тренировках, стараться поддерживать активность в наших соц. сетях и других инициативах PANDORA.",
        "Про индивидуальные занятия: к сожалению, в данный момент, тренер не берёт учеников под индивидуальные занятия. Связано это с загруженностью в рабочем графике (да, тренер еще работает в другой сфере), а также со стоимостью аренды зала. Но есть исключения: если тебе нужна подготовка к конкурсу, к съемке кавера, ты уже выучил танец и тебе не хватает опытного человека, который укажет на недостатки, поможет улучшить номер, то за этим всегда пожалуйста. Настя поможет, чем сможет. Это можно решить как в онлайн формате (скидываешь видео своего танца, получаешь фидбек (обратную связь)), так и в особенных случая в оффлайн режиме, в зале. ",
    ]

}
</script>

<style lang="scss">
    .rules {
        @media all and (max-width: 500px) {
            margin-top: 30px;
        }
        &-body {
            margin-bottom: 30px;
        }
        p {
            color:$color-black;
        }
        &>p {
            margin-bottom: 30px;
            &:nth-last-of-type(1) {
                margin-bottom: 15px;
            }
        }
    }
</style>